import random


def get_numbers_ticket(min, max, quantity):
    if min < 1 or max > 1000 or min > quantity or quantity > max:
        raise Exception("Doesn't match (min < 1 or max > 1000 or min > quantity or quantity > max)", min, max, quantity)
    possible_values = range(min, max)
    return sorted(random.sample(possible_values, k=quantity))


def is_all_unique(numbers):
    unique_only = set(numbers)
    return len(unique_only) == len(numbers)


molod_sport_loto = get_numbers_ticket(1, 36, 5)
print(molod_sport_loto)
assert is_all_unique(molod_sport_loto)

molod_sport_loto_2 = get_numbers_ticket(1, 36, 5)
print(molod_sport_loto_2)
assert is_all_unique(molod_sport_loto_2)

assert molod_sport_loto != molod_sport_loto_2

try:
    get_numbers_ticket(0, 1111, 2222)
except Exception as e:
    msg, min, max, quantity = e.args
    print(msg + ". min, max, quantity: ", min, max, quantity)
    exit(-1)

#Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами, що випали
# випадковим чином і в певному діапазоні під час чергового тиражу. Наприклад, необхідно вгадати
# шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.

#Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати набір унікальних
# випадкових чисел для таких лотерей. Вона буде повертати випадковий набір чисел у межах заданих параметрів, причому всі
# випадкові числа в наборі повинні бути унікальні.



#Вимоги до завдання:

#Параметри функції:
#min - мінімальне можливе число у наборі (не менше 1).
#max - максимальне можливе число у наборі (не більше 1000).
#quantity - кількість чисел, які потрібно вибрати (значення між min і max).
#Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
#Функція повертає список випадково вибраних, відсортованих чисел. Числа в наборі не повинні повторюватися.
# Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список.


#Рекомендації для виконання:

#Переконайтеся, що вхідні параметри відповідають заданим обмеженням.
#Використовуйте модуль random для генерації випадкових чисел.
#Використовуйте множину або інший механізм для забезпечення унікальності чисел.
#Пам'ятайте, що функція get_numbers_ticket повертає відсортований список унікальних чисел.


#Критерії оцінювання:

#Валідність вхідних даних: функція повинна перевіряти коректність параметрів.
#Унікальність результату: усі числа у видачі повинні бути унікальними.
#Відповідність вимогам: результат має бути у вигляді відсортованого списку.
#Читабельність коду: код має бути чистим і добре документованим.


#Приклад: Припустимо, вам потрібно вибрати 6 унікальних чисел для лотерейного квитка, де числа повинні бути у діапазоні
# від 1 до 49. Ви можете використати вашу функцію так:

#lottery_numbers = get_numbers_ticket(1, 49, 6)
#print("Ваші лотерейні числа:", lottery_numbers)

#Цей код викликає функцію get_numbers_ticket з параметрами min=1, max=49 та quantity=6. В результаті ви отримаєте
# список з 6 випадковими, унікальними та відсортованими числами, наприклад, [4, 15, 23, 28, 37, 45]. Кожен раз при
# виклику функції ви отримуватимете різний набір чисел.


